Revit 2024 API
PartUtils.AreElementsValidForCreateParts Method
 Identifies if the given elements can be used to create parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool AreElementsValidForCreateParts(
	Document document,
	ICollection<ElementId> elementIds
)
Visual Basic
Public Shared Function AreElementsValidForCreateParts ( _
	document As Document, _
	elementIds As ICollection(Of ElementId) _
) As Boolean
Visual C++
public:
static bool AreElementsValidForCreateParts(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
elementIds
Type: System.Collections.Generic.ICollection<ElementId>
 Element ids to be tested for validity for creating parts.
Return Value
 True if all member ids are valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
Autodesk.Revit.DB Namespace